Repository: Yugyd/quiz-platform-ios
Catalog: Quiz/AppLocalizable.xcstrings
Source language: en
Languages: ru

# ai_connection_details_action_delete
source: Delete
ru: Удалить

# ai_connection_details_action_save
source: Save
ru: Сохранить

# ai_connection_details_api_key
source: API Key
ru: Ключ API

# ai_connection_details_description
source: Create a key using the official AI provider documentation
ru: Создайте ключ используя официальную документацию провайдера ИИ

# ai_connection_details_name
source: Name
ru: Имя

# ai_connection_details_open
source: Learn more
ru: Создать

# ai_connection_details_project_folder
source: Project Folder
ru: Проект

# ai_connection_details_provider
source: AI Provider
ru: Провайдер ИИ

# ai_connection_details_title
source: API Key Creation Guide
ru: Инструкция по созданию ключа

# ai_connection_details_title_add
source: New AI Connection
ru: Новое ИИ подключение

# ai_connection_details_title_edit
source: Edit AI Connection
ru: Редактирование ИИ подключения

# common_course_banner_continue
source: Continue
ru: Продолжить

# common_course_banner_hide
source: Hide
ru: Скрыть

# common_course_banner_title
source: Continue studying the started course
ru: Продолжить изучать начатый курс<

# content_empty_state_button
source: Choose file
ru: Выбрать файл

# content_empty_state_button_data_format
source: Data format
ru: Формат данных

# content_empty_state_message
source: Select a new content file and then enjoy the app with your content.
ru: Выберите новый файл с контеном, а затем наслаждайтесь приложением с вашим контентом.

# content_empty_state_new_file
source: New file
ru: Новый файл

# content_empty_state_note
source: Content must match the data format.
ru: Контент, должен соответствовать формату данных.

# content_empty_state_title
source: Get started
ru: Начало работы

# content_error_add_is_failed
source: Failed to add content
ru: Не удалось добавить контент

# content_error_content_format_url_not_loaded
source: Content format resource link not loaded
ru: Ссылка на ресурс формата контента не загружена

# content_error_delete_is_failed
source: Failed to delete content
ru: Не удалось удалить контент

# content_error_invalid_uri
source: Failed to access content file
ru: Не удалось получить доступ к файлу контента

# content_error_not_added_content_is_exists
source: Content has already been added
ru: Контент уже добавлен

# content_error_not_select_and_delete
source: The selected content is invalid and has been removed
ru: Выбранный контент невалидный и был удален

# content_error_one_item_not_delete
source: The only content cannot be deleted
ru: Единственный контент не может быть удален

# content_error_select_is_failed
source: Failed to select content
ru: Не удалось выбрать контент

# content_error_selected_item_not_delete
source: Selected content cannot be deleted
ru: Выбранный контент не может быть удален

# correct_msg_correct_pro_available
source: Available only in Pro.
ru: Доступно только в Про.

# correct_msg_correct_quest
source: Correct mistakes to reinforce the material. All your mistakes are collected here.
ru: Исправляйте ошибки для закрепления материала. Здесь собраны все ошибки.

# correct_title_remember_quest
source: Now questions will be remembered!
ru: Теперь вопросы запомнятся!

# course_details_start_test
source: Start Testing
ru: Проверить знания

# course_list_title
source: Courses
ru: Курсы

# design_system_action_game
source: Play
ru: Играть

# design_system_error_base
source: Something went wrong
ru: Что-то пошло не так

# design_system_error_fields
source: Please fill in all fields
ru: Заполните все поля

# design_system_format_record_progress
source: of
ru: из

# design_system_title_empty_state
source: Oops, no data
ru: Упс, нет данных

# design_system_title_empty_state_description
source: Try reloading
ru: Попробуйте перезагрузить экран

# design_system_title_empty_state_retry
source: Retry
ru: Повторить

# ds_game_mode_title_ai_tasks
source: AI Tasks
ru: ИИ Задания

# ds_game_mode_title_arcade
source: Arcade
ru: Аркада

# ds_game_mode_title_marathon
source: Marathon
ru: Марафон

# ds_game_mode_title_sprint
source: Sprint
ru: Спринт

# ds_navbar_title_correct
source: Correct
ru: Правка

# ds_navbar_title_courses
source: Courses
ru: Курсы

# ds_navbar_title_profile
source: Profile
ru: Профиль

# ds_navbar_title_progress
source: Progress
ru: Прогресс

# ds_navbar_title_theme
source: Themes
ru: Темы

# end_action_leave_rate
source: Leave feedback
ru: Оставьте отзыв

# end_action_new_game
source: New game
ru: Новая игра

# end_action_show_error
source: View mistakes
ru: Смотреть ошибки

# end_action_skip
source: Skip
ru: Пропустить

# end_msg_new_record
source: New record set! Did you enjoy it?
ru: Установлен новый рекорд! Вам понравилось?

# end_title_well
source: Excellent!
ru: Отлично!

# end_title_work_error
source: Working on mistakes
ru: Работа над ошибками

# errors_title_error_list
source: Error list
ru: Список ошибок

# errors_title_quest
source: Question
ru: Вопрос

# errors_title_true_answer
source: Correct answer
ru: Правильный ответ

# profile_add_ai_connection
source: Add AI Connection
ru: Добавить ИИ подключение

# profile_content_banner_rate
source: Rate
ru: Оценить

# profile_content_banner_report_error
source: Report a bug
ru: Сообщить о проблеме

# profile_content_banner_subtitle
source: The application is based on the open-source Quiz-Platform solution. We'd love to hear from you about the platform on GitHub.
ru: Приложение основано на open-source решении Quiz-Platform. Будем рады вашей оценке платформы на GitHub.

# profile_restore_purchase_alert_action
source: Ok
ru: Ок

# profile_restore_purchase_alert_error_msg
source: Purchases have not been restored. Try again.
ru: Покупки не восстановлены. Повторите попытку.

# profile_restore_purchase_alert_error_title
source: Error
ru: Ошибка

# profile_restore_purchase_alert_msg
source: Purchases have been restored.
ru: Покупки восстановлены.

# profile_restore_purchase_alert_title
source: Successfully
ru: Успешно

# profile_title_ai
source: Connection
ru: Подключение

# profile_title_content
source: Content
ru: Контент

# profile_title_enable_ai
source: Enable AI Beta
ru: Включить ИИ Бета

# profile_title_feedback
source: Feedback
ru: Обратная связь

# profile_title_other_apps
source: Our apps
ru: Наши приложения

# profile_title_please_us
source: Make us happy
ru: Порадовать нас

# profile_title_privacy_policy
source: Privacy policy
ru: Политика конфиденциальности

# profile_title_pro_version
source: Pro version
ru: Про-версия

# profile_title_purchases
source: Purchases
ru: Покупки

# profile_title_rate_app
source: Rate the app
ru: Оцените приложение

# profile_title_report_error
source: Report an error
ru: Сообщите об ошибке

# profile_title_section_ai
source: AI
ru: Искусственный интеллект

# profile_title_settings
source: Settings
ru: Настройки

# profile_title_share_app
source: Share app
ru: Расскажите другу

# profile_title_show_answer
source: Show answer
ru: Просмотр ответа

# profile_title_social
source: Social networks
ru: Социальные сети

# profile_title_sorting_quest
source: Question sorting
ru: Сортировка вопросов

# profile_title_telegram
source: Telegram channel
ru: Telegram-канал

# profile_title_telegram_promo
source: Daily questions and feedback
ru: Ежедневные вопросы и обратная связь

# profile_title_vibration
source: Vibration
ru: Вибрация

# progress_title_level_academic
source: Academician
ru: Академик

# progress_title_level_amateur
source: Amateur
ru: Любитель

# progress_title_level_candidate
source: Candidate of Sciences
ru: Кандидат наук

# progress_title_level_doctor
source: Doctor of Sciences
ru: Доктор наук

# progress_title_level_master
source: Master
ru: Магистр

# progress_title_level_postgraduate
source: Postgraduate
ru: Аспирант

# progress_title_level_professor
source: Professor
ru: Профессор

# progress_title_level_schoolboy
source: Schoolboy
ru: Ученик

# progress_title_level_student
source: Student
ru: Студент

# theme_action_close
source: Close
ru: Закрыть

# theme_dialog_action_info
source: Information
ru: Информация

# transition_format_time_second
source: sec.
ru: сек.
